app/Controllers/BerandaAdminController.php

SELECT *
FROM `pengaduan`
SELECT *
FROM `user`
SELECT *
FROM `artikel`
ORDER BY `id_artikel` DESC
---
    public function BerandaAdmin(){
        $alamat = $this->DataAlamat->findAll();
        $pengudanHariIni = $this->DataPengaduan->findAll();
        $pengguna = $this->DataUser->findAll();
        $artikel = $this->DataArtikel->orderBy('id_artikel', 'DESC')->findAll();