app/Controllers/Galeri.php

    public function galeri()
    {
        $hakAkses = session()->get('level');
        $galeri = $this->DataGaleri->findAll();
---
SELECT *
FROM `galeri`