app/Controllers/Login.php

SELECT *
FROM `user`
---
    public function login()
    {
        $user = $this->DataUser->findAll();