app/Controllers/Login.php

    public function verifikasiLogin(){
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->DataUser->where('username', $username)->where('password', $password)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'mimin 22'
AND `password` = '12345'
 LIMIT 1