app/Controllers/ManajementProfil.php

    public function ManajementProfil()
    {
        $profil = ($this->DataProfil->findAll());
---
SELECT *
FROM `profil`

    public function EditProfil($kategori)
    {

        $profil = ($this->DataProfil->findAll());
---
SELECT *
FROM `profil`