app/Controllers/ManajementAkun.php

    public function SimpanAkun()
    {

        $this->DataAkun->save([
            'username' => $this->request->getVar('username'),
            'level' => $this->request->getVar('level'),
            'email' => $this->request->getVar('email'),
            'password' => $this->request->getVar('password')
        ]);
---
INSERT INTO `user` (`username`, `level`, `email`, `password`, `tanggal_dibuat`, `tanggal_dirubah`) VALUES ('pendi Gaming', 'Pilih...', '082150646254', 'sdsjdkjs', '2023-11-30 12:51:33', '2023-11-30 12:51:33')