app/Controllers/ManajementMateri.php

SELECT *
FROM `materi`
---
    public function ManajementMateri()
    {
        $alamat = $this->DataAlamat->findAll();
        $materi = $this->DataMateri->findAll();