app/Controllers/ManajementArtikel.php

SELECT *
FROM `artikel`
ORDER BY `id_artikel` DESC
---
    public function MajanementArtikel()
    {
        $alamat = $this->DataAlamat->findAll();
        $artikel = $this->DataArtikel->orderBy('id_artikel', 'DESC')->findAll();

UPDATE `artikel` SET `judul` = 'Omagaa', `isi_artikel` = '<p>Tes 123</p>', `gambar` = 'f36e3617b9629510e12dde4862d763b5.jpg', `tanggal_diperbarui` = '2023-12-18 00:17:05'
WHERE `artikel`.`id_artikel` IN ('19')
---
    public function UpdatedArtikel($id){
        $this->DataArtikel->save([
            'id_artikel' => $id,
            'judul' => $this->request->getVar('judul'),
            'isi_artikel' => $this->request->getVar('artikel'),
            'gambar' => $this->request->getVar('gambar')
        ]);