app/Controllers/ManajementProgram.php

    public function ManajementProgram()
    {
        $profil = $this->DataProfil->findAll();
        $program = $this->DataProgram->findAll();
---
SELECT *
FROM `profil`
SELECT *
FROM `program`