app/Controllers/ManajementGaleri.php

SELECT *
FROM `galeri`
---
    public function ManajementGaleri()
    {
        $alamat = $this->DataAlamat->findAll();
        $galeri = $this->DataGaleri->findAll();

INSERT INTO `galeri` (`judul`, `gambar`, `tanggal_dibuat`, `tanggal_diperbarui`) VALUES ('Hulk', 'Feed day 2png.png', '2023-11-21 15:41:10', '2023-11-21 15:41:10')
---
    public function SimpanGaleri(){

        $this->DataGaleri->save([
            'judul' => $this->request->getVar('judul'),
            'gambar' => $this->request->getVar('gambar')
        ]);