app/Controllers/ProgramController.php

    public function program(){
        $alamat = $this->DataAlamat->findAll();
        $program = $this->DataProgram->findAll();
---
SELECT *
FROM `program`