app/Models/ArtikelModel.php

    public function getArtikel($id = false)
    {

        if ($id === false) {
            return $this->findAll();
        }

        return $this->where(['id_artikel' => $id,])->first();
---
SELECT *
FROM `artikel`
WHERE `id_artikel` = '19'
 LIMIT 1

    public function getRandomArtikel()
    {
        $query =  $this->db->table('artikel')
            ->orderBy('RAND()')
            ->limit(1)
            ->get();

        return $query->getRow();
---
SELECT *
FROM `artikel`