app/Models/GaleriModel.php

    public function GetDataGaleriRandom(){
        $query = $this->db->table('galeri')
            ->orderBy('RAND()')
            ->limit(3)
            ->get();

            return $query->getRow();
---
SELECT *
FROM `galeri`
ORDER BY RAND()
 LIMIT 2