app/Models/MateriModel.php

SELECT *
FROM `materi`
ORDER BY RAND()
 LIMIT 2
---
    public function getRandomMateri(){
        $query = $this->orderBy('RAND()')
                    ->limit(2)
                    ->get();

        return $query->getResultArray();