app/Models/PengaduanModel.php

    public function getJumlahPengaduan(){
        $query = $this->db->table('pengaduan')
            ->select('id_pengaduan')
            ->get();
---
SELECT `id_pengaduan`
FROM `pengaduan`