app/Models/ProgramModel.php

    public function getJumlahProgram(){
        $query = $this->db->table('program')
            ->select('id_program')
            ->get();
---
SELECT `id_program`
FROM `program`

    public function getProgram($id){
        return $this->where(['id_program' => $id])->first();
---
SELECT *
FROM `program`
WHERE `id_program` = '2'
 LIMIT 1